app/controllers/play_controller.rb

INSERT INTO "users" ("name", "updated_at", "diff", "created_at") VALUES('asdf', '2009-03-29 21:11:28', 0.0, '2009-03-29 21:11:28')
---
	def end_game
    if :s ==  @board.calculate_winner
      user = User.new(:name => @board.user.name, :diff => @board.calculate_win_diff).save